[Killed] BlockStatement
main/components/Commons/CommonsForm.js:14:34
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
 
-    if (modifiedCommons.lastDay) {
-        modifiedCommons.lastDay = modifiedCommons.lastDay.split("T")[0];
-    }
+    if (modifiedCommons.lastDay) {}
 
     // Stryker disable all
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2022-06-05)

Expected the element to have value:
  2022-06-05
Received:

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:14:9
         modifiedCommons.startingDate = modifiedCommons.startingDate.split("T")[0];
     }
 
-    if (modifiedCommons.lastDay) {
+    if (false) {
         modifiedCommons.lastDay = modifiedCommons.lastDay.split("T")[0];
     }
killedBy: CommonsForm tests renders correctly with date cut off
statusReason: Error: expect(element).toHaveValue(2022-06-05)

Expected the element to have value:
  2022-06-05
Received:

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:41:48
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const nextD = new Date(curr.getFullYear(), curr.getMonth() + 3, curr.getDate());
+    const nextD = new Date(curr.getFullYear(), curr.getMonth() - 3, curr.getDate());
     const nextDString = nextD.toISOString().split('T')[0];
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-02-27)

Expected the element to have value:
  2024-02-27
Received:
  2023-08-27

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:42:51
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
     const nextD = new Date(curr.getFullYear(), curr.getMonth() + 3, curr.getDate());
-    const nextDString = nextD.toISOString().split('T')[0];
+    const nextDString = nextD.toISOString().split("")[0];
     const DefaultVals = {
         name: "", startingBalance: "10000", cowPrice: "100",
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-02-27)

Expected the element to have value:
  2024-02-27
Received:

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:267:96
             </Row>
 
             <Row>
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={``}>
                 <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r3"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:283:47
                     {...register("startingDate", {
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Start date is required" , 
+                            isPresent: (v) => !isNaN(v) && "Start date is required" , 
                             // Stryker disable next-line all
                             crossVal: () => Number(getValues("startingDate")) <= Number(getValues("lastDay")) || "Start date must be on or before last day"}, 
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Start date must be on or before last day/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:302:32
                     id="lastDay"
                     type="date"
                     defaultValue={DefaultVals.lastDay}
-                    isInvalid={!!errors.lastDay}
+                    isInvalid={!errors.lastDay}
                     {...register("lastDay", { 
                         valueAsDate: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:303:34
                     type="date"
                     defaultValue={DefaultVals.lastDay}
                     isInvalid={!!errors.lastDay}
-                    {...register("lastDay", { 
+                    {...register("", { 
                         valueAsDate: true,
                         validate: {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/Commons/CommonsForm.js:306:40
                     {...register("lastDay", { 
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Last Day is required"  
+                            isPresent: () => undefined  
                             //crossVal: () => getValues(getValues("startingDate")) <= getValues(getValues("lastDay")) || "Last Day must come after starting date"
                     
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:306:47
                     {...register("lastDay", { 
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Last Day is required"  
+                            isPresent: (v) => isNaN(v) || "Last Day is required"  
                             //crossVal: () => getValues(getValues("startingDate")) <= getValues(getValues("lastDay")) || "Last Day must come after starting date"
                     
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
