[Killed] BlockStatement
src/main/pages/AdminCreateCommonsPage.js:17:36
         data: newCommons
     });
 
-    const onSuccess = (commons) => {
-        toast(<div>Commons successfully created!
-            <br />{`id: ${commons.id}`}
-            <br />{`name: ${commons.name}`}
-            <br />{`startDate: ${commons.startingDate}`}
-            <br />{`lastDay: ${commons.lastDay}`}
-            <br />{`cowPrice: ${commons.cowPrice}`}
-            <br />{`capacityPerUser: ${commons.capacityPerUser}`}
-            <br />{`carryingCapacity: ${commons.carryingCapacity}`}
-        </div>);
-    }
+    const onSuccess = (commons) => {}
    
     // Stryker disable all
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: <div>Commons successfully created!<br />id: 5<br />name: My New Commons<br />startDate: 2022-03-05T00:00:00<br />lastDay: 2022-06-05T00:00:00<br />cowPrice: 10<br />capacityPerUser: 10<br />carryingCapacity: 25</div>

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:23:20
             <br />{`name: ${commons.name}`}
             <br />{`startDate: ${commons.startingDate}`}
             <br />{`lastDay: ${commons.lastDay}`}
-            <br />{`cowPrice: ${commons.cowPrice}`}
+            <br />{``}
             <br />{`capacityPerUser: ${commons.capacityPerUser}`}
             <br />{`carryingCapacity: ${commons.carryingCapacity}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -7,11 +7,11 @@
    <br />
    startDate: 2022-03-05T00:00:00
