[Killed] ConditionalExpression
src/main/pages/LeaderboardPage.js:53:28
 
   const navigate = useNavigate();
 
-  const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard);
+  const showLeaderboard = (false);
   return (
     <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
killedBy: LeaderboardPage tests renders leaderboard for users when showLeaderboard = true
statusReason: Error: Unable to find an element with the text: Total Wealth. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="LeaderboardPage-main-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] ConditionalExpression
src/main/pages/LeaderboardPage.js:53:28
 
   const navigate = useNavigate();
 
-  const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard);
+  const showLeaderboard = (true);
   return (
     <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
killedBy: LeaderboardPage tests renders leaderboard error message for users when showLeaderboard = false
statusReason: Error: Unable to find an element with the text: You're not authorized to see the leaderboard.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      data-testid="LeaderboardPage-main-div"
      style="background-size: cover; background-image: url(PlayPageBac

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:55:76
 
   const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard);
   return (
-    <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
+    <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: "", backgroundImage: `url(${Background})` }}>
       <BasicLayout>
         <div className="pt-2">
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: expect(element).toHaveAttribute("style", "background-size: cover; background-image: url(PlayPageBackground.png);") // element.getAttribute("style") === "background-size: cover; background-image: url(PlayPageBackground.png);"

Expected the element to have attribute:
  style="background-size: cover; background-image: url(PlayPageBackground.png);"
Received:
  style="background-image: url(PlayP

[Killed] StringLiteral
src/main/pages/LeaderboardPage.js:55:23
 
   const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard);
   return (
-    <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
+    <div data-testid={""} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
       <BasicLayout>
         <div className="pt-2">
killedBy: LeaderboardPage tests renders without crashing for users
statusReason: Error: Unable to find an element by: [data-testid="LeaderboardPage-main-div"]

<body>
  <div>
    <div
      data-testid=""
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] UnaryOperator
src/main/pages/LeaderboardPage.js:58:43
     <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
       <BasicLayout>
         <div className="pt-2">
-          <Button onClick={() => navigate(-1)} data-testid="LeaderboardPage-back-button" style={{ float: "right" }} >
+          <Button onClick={() => navigate(+1)} data-testid="LeaderboardPage-back-button" style={{ float: "right" }} >
             Back
           </Button>
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1

<html>

[Killed] ArrowFunction
src/main/pages/LeaderboardPage.js:58:28
     <div data-testid={"LeaderboardPage-main-div"} style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }}>
       <BasicLayout>
         <div className="pt-2">
-          <Button onClick={() => navigate(-1)} data-testid="LeaderboardPage-back-button" style={{ float: "right" }} >
+          <Button onClick={() => undefined} data-testid="LeaderboardPage-back-button" style={{ float: "right" }} >
             Back
           </Button>
killedBy: LeaderboardPage tests that navigate(-1) is called when Back is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

<html>
  <head />
