[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:13:21
 
     const columns = [
         {
-            Header: 'Farmer',
+            Header: "",
             accessor: 'username', 
         },
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Farmer. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:28:21
                   },
         },
         {
-            Header: 'Cows Owned',
+            Header: "",
             accessor: 'numOfCows', 
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cows Owned. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:36:21
                   },
         },
         {
-            Header: 'Cow Health',
+            Header: "",
             accessor: 'cowHealth', 
             Cell: (props) => {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cow Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:37:23
         },
         {
             Header: 'Cow Health',
-            accessor: 'cowHealth', 
+            accessor: "", 
             Cell: (props) => {
                 return (
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="LeaderboardTable-cell-row-0-col-cowHealth"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:38:30
         {
             Header: 'Cow Health',
             accessor: 'cowHealth', 
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-                  },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
