[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:6:39
 // should take in a players list from a commons
 export default function ReportHeaderTable({ report  }) {
 
-    const USD = new Intl.NumberFormat("en-US", {
+    const USD = new Intl.NumberFormat("", {
         style: "currency",
         currency: "USD"
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: RangeError: Incorrect locale information provided

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:8:19
 
     const USD = new Intl.NumberFormat("en-US", {
         style: "currency",
-        currency: "USD"
+        currency: ""
     });
 
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: RangeError: Invalid currency code :

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:15:43
         {
             Header: 'Cow Price',
             id:"cowPrice",
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.cowPrice);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $100.00
Received:

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:18:30
             accessor: (row, _rowIndex) => {
                 return USD.format(row.cowPrice);
             },
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:24:21
             },
         },
         {
-            Header: 'Milk Price',
+            Header: "",
             id:"milkPrice",
             accessor: (row, _rowIndex) => {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Milk Price. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:26:43
         {
             Header: 'Milk Price',
             id:"milkPrice",
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.milkPrice);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $5.00
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:31:31
             },
             Cell: (props) => {
                 return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
+                  <div style={{}}>{props.value}</div>)
             },
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: right;

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:35:21
             },
         },
         {
-            Header: 'Start Bal',
+            Header: "",
             id:"startingBalance",
             accessor: (row, _rowIndex) => {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Start Bal. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:36:16
         },
         {
             Header: 'Start Bal',
-            id:"startingBalance",
+            id:"",
             accessor: (row, _rowIndex) => {
                 return USD.format(row.startingBalance);
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-startingBalance"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:37:43
         {
             Header: 'Start Bal',
             id:"startingBalance",
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.startingBalance);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $10,000.00
Received:

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:45:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
             },
         },
-        {
-            Header: 'Start Date',
-            id: 'startingDate',
-            accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10)
-
-        },
+        {},
         {
             Header: 'Leaderboard',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:48:23
         {
             Header: 'Start Date',
             id: 'startingDate',
-            accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10)
+            accessor: () => undefined
 
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2023-08-06$/
Received:

[Killed] MethodExpression
main/components/Reports/ReportHeaderTable.js:48:43
         {
             Header: 'Start Date',
             id: 'startingDate',
-            accessor: (row, _rowIndex) => String(row.startingDate).substring(0, 10)
+            accessor: (row, _rowIndex) => String(row.startingDate)
 
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /^2023-08-06$/
Received:
  2023-08-06T00:00:00

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:53:17
         },
         {
             Header: 'Leaderboard',
-            id: 'showLeaderboard',
+            id: "",
             accessor: (row, _rowIndex) => String(row.showLeaderboard) // hack needed for boolean values to show up
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-showLeaderboard"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:54:23
         {
             Header: 'Leaderboard',
             id: 'showLeaderboard',
-            accessor: (row, _rowIndex) => String(row.showLeaderboard) // hack needed for boolean values to show up
+            accessor: () => undefined // hack needed for boolean values to show up
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:57:21
             accessor: (row, _rowIndex) => String(row.showLeaderboard) // hack needed for boolean values to show up
         },
         {
-            Header: 'Capacity',
+            Header: "",
             accessor: 'carryingCapacity',
             Cell: (props) => {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Capacity. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:59:30
         {
             Header: 'Capacity',
             accessor: 'carryingCapacity',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:65:21
             },
         },
         {
-            Header: 'Degrad Rate',
+            Header: "",
             accessor: 'degradationRate',
             Cell: (props) => {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Degrad Rate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block

[Killed] BlockStatement
main/components/Reports/ReportHeaderTable.js:67:30
         {
             Header: 'Degrad Rate',
             accessor: 'degradationRate',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:72:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
             },
         },
-        {
-            Header: 'BelowCap',
-            accessor: 'belowCapacityHealthUpdateStrategy',
-        },
+        {},
         {
             Header: 'AboveCap',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:77:21
             accessor: 'belowCapacityHealthUpdateStrategy',
         },
         {
-            Header: 'AboveCap',
+            Header: "",
             accessor: 'aboveCapacityHealthUpdateStrategy',
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: AboveCap. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] ArrayDeclaration
main/components/Reports/ReportHeaderTable.js:85:15
     const testid = "ReportHeaderTable";
 
     return <OurTable
-        data={[report]}
+        data={[]}
         columns={columns}
         testid={testid}
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-cowPrice"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
