[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.js:12:9
     });
 
     const columns = [
-        {
-            Header: 'userId',
-            accessor: 'userId', 
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
-        },
+        {},
         {
             Header: 'Username',
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:13:21
 
     const columns = [
         {
-            Header: 'userId',
+            Header: "",
             accessor: 'userId', 
             Cell: (props) => {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: userId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:15:30
         {
             Header: 'userId',
             accessor: 'userId', 
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:21:21
             },
         },
         {
-            Header: 'Username',
+            Header: "",
             accessor: 'username',
         },
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Username. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:27:43
         {
             Header: 'Total Wealth',
             id:"totalWealth",
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.totalWealth);
-            },
+            accessor: (row, _rowIndex) => {},
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $9,745.00
Received:

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:38:30
         {
             Header: 'Num Cows',
             accessor: 'numOfCows', 
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:44:21
             },
         },
         {
-            Header: 'Avg Cow Health',
+            Header: "",
             accessor: 'avgCowHealth',
             Cell: (props) => {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Avg Cow Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: bl

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:46:30
         {
             Header: 'Avg Cow Health',
             accessor: 'avgCowHealth',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportLineTable.js:51:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
             },
         },
-        {
-            Header: 'Cows Bought',
-            accessor: 'cowsBought',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
-        },
+        {},
         {
             Header: 'Cows Sold',
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:52:21
             },
         },
         {
-            Header: 'Cows Bought',
+            Header: "",
             accessor: 'cowsBought',
             Cell: (props) => {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cows Bought. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:53:23
         },
         {
             Header: 'Cows Bought',
-            accessor: 'cowsBought',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-cowsBought"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:54:30
         {
             Header: 'Cows Bought',
             accessor: 'cowsBought',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:56:43
             accessor: 'cowsBought',
             Cell: (props) => {
                 return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
+                  <div style={{textAlign: ""}}>{props.value}</div>)
             },
         },
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: right;

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:61:23
         },
         {
             Header: 'Cows Sold',
-            accessor: 'cowsSold',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-cowsSold"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:62:30
         {
             Header: 'Cows Sold',
             accessor: 'cowsSold',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/Reports/ReportLineTable.js:70:30
         {
             Header: 'Cow Deaths',
             accessor: 'cowDeaths',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:76:21
             },
         },
         {
-            Header: 'Create Date',
+            Header: "",
             accessor: 'createDate',
         },
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create Date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block
