[Killed] BooleanLiteral
main/components/Reports/ReportTable.js:5:60
 import { useNavigate } from "react-router-dom";
 
 // should take in a players list from a commons
-export default function ReportTable({ reports, storybook = false, buttons=true }) {
+export default function ReportTable({ reports, storybook = true, buttons=true }) {
 
     const testid = "ReportTable";
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/report/1"

Number of calls: 0

[Killed] BooleanLiteral
main/components/Reports/ReportTable.js:5:75
 import { useNavigate } from "react-router-dom";
 
 // should take in a players list from a commons
-export default function ReportTable({ reports, storybook = false, buttons=true }) {
+export default function ReportTable({ reports, storybook = false, buttons=false }) {
 
     const testid = "ReportTable";
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-View Report-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportTable.js:11:38
 
     const navigate = useNavigate();
 
-    const reportCallback = (cell) => {
-        const route = `/admin/report/${cell.row.values["id"]}`
-        if (storybook) {
-            window.alert(`would navigate to ${route}`);
-        } else {
-            navigate(route)
-        }
-    }
+    const reportCallback = (cell) => {}
 
     const columns = [
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/report/1"

Number of calls: 0

[Killed] StringLiteral
main/components/Reports/ReportTable.js:12:56
     const navigate = useNavigate();
 
     const reportCallback = (cell) => {
-        const route = `/admin/report/${cell.row.values["id"]}`
+        const route = `/admin/report/${cell.row.values[""]}`
         if (storybook) {
             window.alert(`would navigate to ${route}`);
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/report/1"
Received: "/admin/report/undefined"

Number of calls: 1

[Killed] BlockStatement
main/components/Reports/ReportTable.js:13:24
 
     const reportCallback = (cell) => {
         const route = `/admin/report/${cell.row.values["id"]}`
-        if (storybook) {
-            window.alert(`would navigate to ${route}`);
-        } else {
+        if (storybook) {} else {
             navigate(route)
         }
killedBy: ReportTable tests When on storybook, calls window.alert
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "would navigate to /admin/report/1"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Reports/ReportTable.js:13:13
 
     const reportCallback = (cell) => {
         const route = `/admin/report/${cell.row.values["id"]}`
-        if (storybook) {
+        if (true) {
             window.alert(`would navigate to ${route}`);
         } else {
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/report/1"

Number of calls: 0

[Killed] BlockStatement
main/components/Reports/ReportTable.js:15:16
         const route = `/admin/report/${cell.row.values["id"]}`
         if (storybook) {
             window.alert(`would navigate to ${route}`);
-        } else {
-            navigate(route)
-        }
+        } else {}
     }
 
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/admin/report/1"

Number of calls: 0

[Killed] BlockStatement
main/components/Reports/ReportTable.js:24:30
         {
             Header: 'id',
             accessor: 'id',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportTable.js:29:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
             },
         },
-        {
-            Header: 'commonsId',
-            accessor: 'commonsId',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
-        },
+        {},
         {
             Header: 'Name',
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportTable.js:30:21
             },
         },
         {
-            Header: 'commonsId',
+            Header: "",
             accessor: 'commonsId',
             Cell: (props) => {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: commonsId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] BlockStatement
main/components/Reports/ReportTable.js:32:30
         {
             Header: 'commonsId',
             accessor: 'commonsId',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportTable.js:37:9
                   <div style={{textAlign: "right"}}>{props.value}</div>)
             },
         },
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
+        {},
         {
             Header: 'Create Date',
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Reports/ReportTable.js:41:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'Create Date',
-            accessor: 'createDate',
-        },
+        {},
         {
             Header: 'Num Users',
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportTable.js:43:23
         },
         {
             Header: 'Create Date',
-            accessor: 'createDate',
+            accessor: "",
         },
         {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-createDate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Reports/ReportTable.js:47:23
         },
         {
             Header: 'Num Users',
-            accessor: 'numUsers',
+            accessor: "",
             Cell: (props) => {
                 return (
killedBy: ReportTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-numUsers"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] BlockStatement
main/components/Reports/ReportTable.js:48:30
         {
             Header: 'Num Users',
             accessor: 'numUsers',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/Reports/ReportTable.js:56:30
         {
             Header: 'Num Cows',
             accessor: 'numCows',
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
     ];
killedBy: ReportTable tests Has the expected column headers and content
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/components/Reports/ReportTable.js:63:18
         },
     ];
 
-    if (buttons) {
-        columns.push(ButtonColumn("View Report", "secondary", reportCallback, testid));
-    }
+    if (buttons) {}
     return <OurTable
         data={reports}
killedBy: ReportTable tests When not on storybook, navigates to view page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportTable-cell-row-0-col-View Report-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ConditionalExpression
main/components/Reports/ReportTable.js:63:9
         },
     ];
 
-    if (buttons) {
+    if (true) {
         columns.push(ButtonColumn("View Report", "secondary", reportCallback, testid));
     }
killedBy: AdminViewReportPage tests back to reports button navigates correctly
statusReason: TestingLibraryElementError: Found multiple elements with the text: View Report

Here are the matching elements:

<th
  colspan="1"
  data-testid="ReportTable-header-View Report"
  role="columnheader"
