[Killed] StringLiteral
src/main/pages/PlayPage.js:122:35
   };
 
   return (
-    <div style={{ backgroundSize: 'cover', backgroundImage: `url(${Background})` }} data-testid="playpage-div">
+    <div style={{ backgroundSize: "", backgroundImage: `url(${Background})` }} data-testid="playpage-div">
       <BasicLayout >
         <Container >
killedBy: PlayPage tests Make sure div has correct attributes
statusReason: Error: expect(element).toHaveAttribute("style", StringContaining "background-size: cover; background-image: url(PlayPageBackground.png);") // element.getAttribute("style") === StringContaining "background-size: cover; background-image: url(PlayPageBackground.png);"

Expected the element to have attribute:
  style=StringContaining "background-size: cover; background-image: url(PlayPageBackground.pn

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:128:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
+          {true &&
             <CardGroup >
               <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
killedBy: PlayPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'commons')

[Killed] ConditionalExpression
src/main/pages/PlayPage.js:128:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
-            <CardGroup >
-              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-            </CardGroup>
+          {true
           }
         </Container>
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
