[Killed] BooleanLiteral
main/components/Chat/ChatFeature.js:10:52
 import ChatBubble from "../../../assets/ChatBubble.svg";
 
 const ChatFeature = ({commonsId}) => {
-  const [isChatClosed, setIsChatClosed] = useState(true);
+  const [isChatClosed, setIsChatClosed] = useState(false);
 
   const toggleChatWindow = () => {
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BlockStatement
main/components/Chat/ChatFeature.js:12:34
 const ChatFeature = ({commonsId}) => {
   const [isChatClosed, setIsChatClosed] = useState(true);
 
-  const toggleChatWindow = () => {
-    setIsChatClosed((prevState) => !prevState);
-  };
+  const toggleChatWindow = () => {};
 
   const chatIconStyle = {
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] BooleanLiteral
main/components/Chat/ChatFeature.js:13:36
   const [isChatClosed, setIsChatClosed] = useState(true);
 
   const toggleChatWindow = () => {
-    setIsChatClosed((prevState) => !prevState);
+    setIsChatClosed((prevState) => prevState);
   };
 
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] ArrowFunction
main/components/Chat/ChatFeature.js:13:21
   const [isChatClosed, setIsChatClosed] = useState(true);
 
   const toggleChatWindow = () => {
-    setIsChatClosed((prevState) => !prevState);
+    setIsChatClosed(() => undefined);
   };
 
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()


<html>
  <head />
  <body>
    <div>

[Killed] StringLiteral
main/components/Chat/ChatFeature.js:20:12
     width: '95px',
     position: 'fixed',
     bottom: '10px',
-    right: '30px',
+    right: "",
   };
 
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  bottom: 10px;
  position: fixed;
- right: 30px;
  width: 95px;

[Killed] StringLiteral
main/components/Chat/ChatFeature.js:31:12
   };
 
   const chatContainerStyle = {
-    width: '550px',
+    width: "",
     position: 'fixed',
     bottom: '130px',
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

  bottom: 130px;
  position: fixed;
  right: 10px;
- width: 550px;

[Killed] ConditionalExpression
main/components/Chat/ChatFeature.js:39:8
 
   return (
     <div data-testid="chat-feature-container">
-      {isChatClosed && <Image style={chatBubbleStyle} src ={ChatBubble} alt="" data-testid="chat-bubble-icon"/>}
+      {false}
       <div style={chatContainerStyle} data-testid="playpage-chat-div">
         {!isChatClosed && <ChatPanel commonsId={commonsId}/>}
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="chat-bubble-icon"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] ConditionalExpression
main/components/Chat/ChatFeature.js:39:8
 
   return (
     <div data-testid="chat-feature-container">
-      {isChatClosed && <Image style={chatBubbleStyle} src ={ChatBubble} alt="" data-testid="chat-bubble-icon"/>}
+      {true}
       <div style={chatContainerStyle} data-testid="playpage-chat-div">
         {!isChatClosed && <ChatPanel commonsId={commonsId}/>}
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="chat-bubble-icon"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
main/components/Chat/ChatFeature.js:41:10
     <div data-testid="chat-feature-container">
       {isChatClosed && <Image style={chatBubbleStyle} src ={ChatBubble} alt="" data-testid="chat-bubble-icon"/>}
       <div style={chatContainerStyle} data-testid="playpage-chat-div">
-        {!isChatClosed && <ChatPanel commonsId={commonsId}/>}
+        {!isChatClosed || <ChatPanel commonsId={commonsId} />}
         <Button data-testid="chat-toggle" variant="outline-light" onClick={toggleChatWindow}>
           <Image style={chatIconStyle} src={ChatClosedIcon} alt="Click to open the chat" data-testid="chat-closed-icon"/>
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ConditionalExpression
main/components/Chat/ChatFeature.js:41:10
     <div data-testid="chat-feature-container">
       {isChatClosed && <Image style={chatBubbleStyle} src ={ChatBubble} alt="" data-testid="chat-bubble-icon"/>}
       <div style={chatContainerStyle} data-testid="playpage-chat-div">
-        {!isChatClosed && <ChatPanel commonsId={commonsId}/>}
+        {false}
         <Button data-testid="chat-toggle" variant="outline-light" onClick={toggleChatWindow}>
           <Image style={chatIconStyle} src={ChatClosedIcon} alt="Click to open the chat" data-testid="chat-closed-icon"/>
killedBy: PlayPage tests Chat toggle button opens and closes the ChatPanel
statusReason: Error: Unable to find an element by: [data-testid="ChatPanel"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] ConditionalExpression
main/components/Chat/ChatFeature.js:44:12
         {!isChatClosed && <ChatPanel commonsId={commonsId}/>}
         <Button data-testid="chat-toggle" variant="outline-light" onClick={toggleChatWindow}>
           <Image style={chatIconStyle} src={ChatClosedIcon} alt="Click to open the chat" data-testid="chat-closed-icon"/>
-          {!isChatClosed && <Image style={chatIconStyle} src={ChatOpenedIcon} alt="Click to close the chat" data-testid="chat-opened-icon"/>}
+          {true}
         </Button>
       </div>
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: Unable to find an element by: [data-testid="chat-opened-icon"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >

[Killed] LogicalOperator
main/components/Chat/ChatFeature.js:44:12
         {!isChatClosed && <ChatPanel commonsId={commonsId}/>}
         <Button data-testid="chat-toggle" variant="outline-light" onClick={toggleChatWindow}>
           <Image style={chatIconStyle} src={ChatClosedIcon} alt="Click to open the chat" data-testid="chat-closed-icon"/>
-          {!isChatClosed && <Image style={chatIconStyle} src={ChatOpenedIcon} alt="Click to close the chat" data-testid="chat-opened-icon"/>}
+          {!isChatClosed || <Image style={chatIconStyle} src={ChatOpenedIcon} alt="Click to close the chat" data-testid="chat-opened-icon" />}
         </Button>
       </div>
killedBy: PlayPage tests Chat button and container have correct styles
statusReason: Error: Unable to find an element by: [data-testid="chat-opened-icon"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
