[Killed] ConditionalExpression
src/main/pages/PlayPage.js:127:12
           {!!currentUser && <CommonsPlay currentUser={currentUser} />}
           {!!commonsPlus && <CommonsOverview commonsPlus={commonsPlus} currentUser={currentUser} />}
           <br />
-          {!!userCommons && !!commonsPlus &&
-            <CardGroup >
-              <ManageCows userCommons={userCommons} commons={commonsPlus.commons} onBuy={onBuy} onSell={onSell} />
-              <FarmStats userCommons={userCommons} />
-              <Profits userCommons={userCommons} profits={userCommonsProfits} />
-            </CardGroup>
+          {false
           }
         </Container>
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: Unable to find an element by: [data-testid="buy-cow-button"]

<body>
  <div>
    <div
      data-testid="playpage-div"
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
