[Killed] StringLiteral
main/components/Commons/CommonsTable.js:45:23
     const columns = [
         {
             Header: <span>id</span>,
-            accessor: 'commons.id', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
 
         },
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:74:23
         },
         {
             Header: <small>Degrad<br />Rate</small>,
-            accessor: row => row.commons.degradationRate,
+            accessor: () => undefined,
             id: 'commons.degradationRate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0.01
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:84:23
         },
         {
             Header: <small>Cows</small>,
-            accessor: 'totalCows'
+            accessor: ""
         },
         {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:86:9
             Header: <small>Cows</small>,
             accessor: 'totalCows'
         },
-        {
-            Header: <small>Cap<br />Per<br />Usr</small>,
-            accessor: row => row.commons.capacityPerUser,
-            id: 'commons.capacityPerUser'
-        },
+        {},
         {
             Header: <small>Carrying<br />Cap</small>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:88:23
         },
         {
             Header: <small>Cap<br />Per<br />Usr</small>,
-            accessor: row => row.commons.capacityPerUser,
+            accessor: () => undefined,
             id: 'commons.capacityPerUser'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:93:23
         },
         {
             Header: <small>Carrying<br />Cap</small>,
-            accessor: row => row.commons.carryingCapacity,
+            accessor: () => undefined,
             id: 'commons.carryingCapacity'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:
