[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:9:44
 
 function CommonsForm({initialCommons, submitAction, buttonLabel = "Create"}) {
     
-    let modifiedCommons = initialCommons ? { ...initialCommons } : {};  // make a shallow copy of initialCommons
+    let modifiedCommons = initialCommons ? {} : {};  // make a shallow copy of initialCommons
     
     // Stryker disable all
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: Error: expect(element).toHaveValue(Seths Common)

Expected the element to have value:
  Seths Common
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:35:54
     // Stryker restore all
 
     const {data: healthUpdateStrategies} = useBackend(
-        "/api/commons/all-health-update-strategies", {
-            method: "GET",
-            url: "/api/commons/all-health-update-strategies",
-        },
+        "/api/commons/all-health-update-strategies", {},
     );
 
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:45:34
     // Stryker disable next-line all
     const defaultName = "";
 
-    const defaultBelowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+    const defaultBelowStrategy = initialCommons?.belowCapacityStrategy && healthUpdateStrategies?.defaultBelowCapacity;
     const defaultAboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:45:75
     // Stryker disable next-line all
     const defaultName = "";
 
-    const defaultBelowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
+    const defaultBelowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies.defaultBelowCapacity;
     const defaultAboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'defaultBelowCapacity')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:46:34
     const defaultName = "";
 
     const defaultBelowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
-    const defaultAboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
+    const defaultAboveStrategy = initialCommons.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
 
     return (
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'aboveCapacityStrategy')

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:46:34
     const defaultName = "";
 
     const defaultBelowStrategy = initialCommons?.belowCapacityStrategy || healthUpdateStrategies?.defaultBelowCapacity;
-    const defaultAboveStrategy = initialCommons?.aboveCapacityStrategy || healthUpdateStrategies?.defaultAboveCapacity;
+    const defaultAboveStrategy = false;
 
     return (
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: Error: expect(element).toHaveAttribute("selected") // element.hasAttribute("selected")

Expected the element to have attribute:
  selected
Received:
  null

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:50:14
 
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
-            {initialCommons?.id ? 
+            {initialCommons.id ? 
                 <Form.Group className="mb-3">
                     <Form.Label htmlFor="id">Id</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:82:44
                                 id="name"
                                 type="text"
                                 defaultValue={defaultName}
-                                isInvalid={!!errors.name}
+                                isInvalid={!errors.name}
                                 {...register("name", {required: "Commons name is required"})}
                             />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:92:22
                     </Form.Group>
                 </Col>
                 <Col md={6}>
-                    {initialCommons?.startingBalance && 
+                    {initialCommons.startingBalance && 
                     <Form.Group className="mb-3">
                         <Form.Label htmlFor="startingBalance">Starting Balance</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'startingBalance')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:106:44
                                 type="number"
                                 step="0.01"
                                 defaultValue={initialCommons.startingBalance}
-                                isInvalid={!!errors.startingBalance}
+                                isInvalid={!errors.startingBalance}
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:124:22
 
             <Row className="flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r1`}>
                 <Col md={6}>
-                    {initialCommons?.cowPrice &&
+                    {initialCommons.cowPrice &&
                     <Form.Group className="mb-3">
                         <Form.Label htmlFor="cowPrice">Cow Price</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:138:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={initialCommons.cowPrice}
-                                isInvalid={!!errors.cowPrice}
+                                isInvalid={!errors.cowPrice}
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:155:22
                     }
                 </Col>
                 <Col md={6}>
-                    {initialCommons?.milkPrice &&
+                    {initialCommons.milkPrice &&
                     <Form.Group className="mb-3">
                         <Form.Label htmlFor="milkPrice">Milk Price</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:169:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={initialCommons.milkPrice}
-                                isInvalid={!!errors.milkPrice}
+                                isInvalid={!errors.milkPrice}
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:187:22
 
             <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r2`}>
                 <Col md={4}>
-                    {initialCommons?.degradationRate &&
+                    {initialCommons.degradationRate &&
                     <Form.Group className="mb-3">
                         <Form.Label htmlFor="degradationRate">Degradation Rate</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'degradationRate')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:201:41
                             type="number"
                             step="0.0001"
                             defaultValue={initialCommons.degradationRate}
-                            isInvalid={!!errors.degradationRate}
+                            isInvalid={!errors.degradationRate}
                             {...register("degradationRate", {
                                 valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:216:22
                     }
                 </Col>
                 <Col md={4}>
-                    {initialCommons?.carryingCapacity &&
+                    {initialCommons.carryingCapacity &&
                     <Form.Group className="mb-3">
                         <Form.Label htmlFor="carryingCapacity">Carrying Capacity</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'carryingCapacity')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:230:41
                             type="number"
                             step="1"
                             defaultValue={initialCommons.carryingCapacity}
-                            isInvalid={!!errors.carryingCapacity}
+                            isInvalid={!errors.carryingCapacity}
                             {...register("carryingCapacity", {
                                 valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:245:22
                     }
                 </Col>
                 <Col md={4}>
-                    {initialCommons?.capacityPerUser &&
+                    {initialCommons.capacityPerUser &&
                     <Form.Group className="mb-3">
                         <Form.Label htmlFor="capacityPerUser">Capacity Per User</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'capacityPerUser')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:259:41
                             type="number"
                             step="1"
                             defaultValue={initialCommons.capacityPerUser}
-                            isInvalid={!!errors.capacityPerUser}
+                            isInvalid={!errors.capacityPerUser}
                             {...register("capacityPerUser", {
                                 valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:275:14
             </Row>
             
             <Row>
-            {initialCommons?.startingDate ?
+            {initialCommons.startingDate ?
             // Stryker disable next-line all
             <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'startingDate')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:290:33
                     id="startingDate"
                     type="date"
                     defaultValue={initialCommons.startingDate}
-                    isInvalid={!!errors.startingDate}
+                    isInvalid={!errors.startingDate}
                     {...register("startingDate", {
                         valueAsDate: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:293:35
                     isInvalid={!!errors.startingDate}
                     {...register("startingDate", {
                         valueAsDate: true,
-                        validate: {
-                            isPresent: (v) => !isNaN(v) || "Start date is required" , 
-                            // Stryker disable next-line all
-                            crossVal: () => Number(getValues("startingDate")) <= Number(getValues("lastDay")) || "Start date must be on or before last day"}, 
+                        validate: {}, 
                 
                     })}
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ArrowFunction
main/components/Commons/CommonsForm.js:294:40
                     {...register("startingDate", {
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Start date is required" , 
+                            isPresent: () => undefined , 
                             // Stryker disable next-line all
                             crossVal: () => Number(getValues("startingDate")) <= Number(getValues("lastDay")) || "Start date must be on or before last day"}, 
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Start Date is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <span />

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:294:47
                     {...register("startingDate", {
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Start date is required" , 
+                            isPresent: (v) => isNaN(v) || "Start date is required" , 
                             // Stryker disable next-line all
                             crossVal: () => Number(getValues("startingDate")) <= Number(getValues("lastDay")) || "Start date must be on or before last day"}, 
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Start date must be on or before last day/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <span />

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:346:38
                     // Stryker disable next-line all
                     isInvalid={!!errors.lastDay}
                     {...register("lastDay", { 
-                        valueAsDate: true,
+                        valueAsDate: false,
                         validate: {
                             isPresent: (v) => !isNaN(v) || "Last Day is required"  
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:347:35
                     isInvalid={!!errors.lastDay}
                     {...register("lastDay", { 
                         valueAsDate: true,
-                        validate: {
-                            isPresent: (v) => !isNaN(v) || "Last Day is required"  
-                        },
+                        validate: {},
                     })}
                 />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Last Day is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <span />

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:348:47
                     {...register("lastDay", { 
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Last Day is required"  
+                            isPresent: (v) => !isNaN(v) && "Last Day is required"  
                         },
                     })}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:348:47
                     {...register("lastDay", { 
                         valueAsDate: true,
                         validate: {
-                            isPresent: (v) => !isNaN(v) || "Last Day is required"  
+                            isPresent: (v) => true  
                         },
                     })}
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Last Day is required/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <span />

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:353:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.lastDay?.message}
+                    {errors.lastDay.message}
                 </Form.Control.Feedback>
             </Form.Group>}
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:383:14
                 </Col>
             </Row>
 
-            {initialCommons?.showLeaderboard ?
+            {initialCommons.showLeaderboard ?
             <Form.Group className="mb-3">
                 <Form.Label htmlFor="showLeaderboard">Show Leaderboard?</Form.Label>
killedBy: CommonsForm tests renders correctly when an initialCommons is not passed in
statusReason: TypeError: Cannot read properties of undefined (reading 'showLeaderboard')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:397:34
                     type="checkbox"
                     id="showLeaderboard"
                     defaultChecked={initialCommons.showLeaderboard}
-                    {...register("showLeaderboard")}
+                    {...register("")}
                 />
                 </OverlayTrigger>
killedBy: CommonsForm tests renders correctly when an initialCommons is passed in
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:414:37
                     data-testid={`${testid}-showLeaderboard`}
                     type="checkbox"
                     id="showLeaderboard"
-                    defaultChecked={false}
+                    defaultChecked={true}
                     {...register("showLeaderboard")}
                 />
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toEqual(expected) // deep equality

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:415:34
                     type="checkbox"
                     id="showLeaderboard"
                     defaultChecked={false}
-                    {...register("showLeaderboard")}
+                    {...register("")}
                 />
                 </OverlayTrigger>
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:425:40
                 <Button type="submit"
                         data-testid="CommonsForm-Submit-Button"
                         className="pl-1 w-30 text-left"
-                        style={{width: '30%'}}
+                        style={{width: ""}}
                 >{buttonLabel}</Button>
             </Row>
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 30%;
