[Killed] BlockStatement
src/main/pages/AdminCreateCommonsPage.js:25:36
         data: newCommons
     });
 
-    const onSuccess = (commons) => {
-        toast(<div>Commons successfully created!
-            <br />{`id: ${commons.id}`}
-            <br />{`name: ${commons.name}`}
-            <br />{`startingBalance: ${commons.startingBalance}`}
-            <br />{`cowPrice: ${commons.cowPrice}`}
-            <br />{`milkPrice: ${commons.milkPrice}`}
-            <br />{`degradationRate: ${commons.degradationRate}`}
-            <br />{`carryingCapacity: ${commons.carryingCapacity}`}
-            <br />{`capacityPerUser: ${commons.capacityPerUser}`}
-            <br />{`startDate: ${commons.startingDate}`}
-            <br />{`aboveCapacityHealthUpdateStrategy: ${commons.aboveCapacityHealthUpdateStrategy}`}
-            <br />{`belowCapacityHealthUpdateStrategy: ${commons.belowCapacityHealthUpdateStrategy}`}
-            <br />{`showLeaderboard: ${commons.showLeaderboard}`}
-        </div>);
-    }
+    const onSuccess = (commons) => {}
    
     // Stryker disable all
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)


Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:29:20
         toast(<div>Commons successfully created!
             <br />{`id: ${commons.id}`}
             <br />{`name: ${commons.name}`}
-            <br />{`startingBalance: ${commons.startingBalance}`}
+            <br />{``}
             <br />{`cowPrice: ${commons.cowPrice}`}
             <br />{`milkPrice: ${commons.milkPrice}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -3,11 +3,11 @@
    <br />
    id: 5

[Killed] StringLiteral
src/main/pages/AdminCreateCommonsPage.js:31:20
             <br />{`name: ${commons.name}`}
             <br />{`startingBalance: ${commons.startingBalance}`}
             <br />{`cowPrice: ${commons.cowPrice}`}
-            <br />{`milkPrice: ${commons.milkPrice}`}
+            <br />{``}
             <br />{`degradationRate: ${commons.degradationRate}`}
             <br />{`carryingCapacity: ${commons.carryingCapacity}`}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -7,11 +7,11 @@
    <br />
    startingBalance: 500
